create_clock -period 20.000 -name clock_pin -waveform {0.000 10.000} [get_ports clock_pin]
set_input_delay -clock [get_clocks clock_pin] -min -add_delay 0.000 [get_ports reset_pin]
set_input_delay -clock [get_clocks clock_pin] -max -add_delay 0.000 [get_ports reset_pin]
set_input_delay -clock [get_clocks clock_pin] -min -add_delay 0.000 [get_ports serialDataIn_pin]
set_input_delay -clock [get_clocks clock_pin] -max -add_delay 0.000 [get_ports serialDataIn_pin]
set_output_delay -clock [get_clocks clock_pin] -min -add_delay 0.000 [get_ports LED_hi_pin]
set_output_delay -clock [get_clocks clock_pin] -max -add_delay 0.000 [get_ports LED_hi_pin]
set_output_delay -clock [get_clocks clock_pin] -min -add_delay 0.000 [get_ports LED_lo_pin]
set_output_delay -clock [get_clocks clock_pin] -max -add_delay 0.000 [get_ports LED_lo_pin]
set_output_delay -clock [get_clocks clock_pin] -min -add_delay 0.000 [get_ports serialDataOut_pin]
set_output_delay -clock [get_clocks clock_pin] -max -add_delay 0.000 [get_ports serialDataOut_pin]
